//
// Created by 김윤재 on 2025. 3. 17..
//


// 중요. 알고리즘의 조건
//  입력 : 0개 이상의 입력이 존재하여야 한다.
//  출력 : 1개 이상의 출력이 존재하여야 한다.
//  명백성 : 각 명령어의 의미는 모호하지 않고 명확해야 한다.
//  유한성 : 한정된 수의 단계 후에는 반드시 종료되어야 한다.
//  유효성 : 각 명령어들은 실행 가능한 연산이여야 한다.



// 알고리즘의 기술 방법

// 1. 영어나 한국어와 같은 자연어
/*
 * 인간이 읽기 쉽다.
* 하지만 자연어의 단어들을 정확하게 정의하지 않으면
의미 전달이 모호해질 우려가 있다.
 *
 */

// 2. 흐름도(flow chart)
/*
 * 직관적이고 이해하기 쉬움
 * 복잡한 알고리즘의 경우 상당히 복잡해짐
 *
 */
// 3. 의사 코드(pseudo-code)
/*
 * 유사코드로 표현된 알고리즘
* 알고리즘 기술에 가장 많이 사용
 프로그램을 구현할 때의 여러 가지 문제들을 감출 수 있다.
즉 알고리즘의 ** 핵심적인 내용 ** 에만 집중할 수 있다.
 *
 */
// 4. 프로그래밍 언어


// 추상데이터 타입 (ADT) => 즉 함수
// 무엇인가는 정의 되어있지만 어떻게 는 숨김


// 추상데이터 타입 정의
// 객체 : 객체지향
// 연산 : 함수


